docs/posts/2015-06-17-evil-and-perception.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Evil and Perception</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Evil and Perception</h1>
<p class="subtitle" role="doc-subtitle">Jun 17, 2015</p>
</header><p>
<a href="http://www.etgarkeret.com">Etgar Keret&rsquo;s</a> new book, <a href="http://www.amazon.com/Seven-Good-Years-Memoir-ebook/dp/B00OYXWKDY/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1434540345&amp;sr=1-1&amp;keywords=the+seven+good+years"><i>The Seven Good Years</i></a> is a collection of essays concerning the interval between the birth of his son and the death of his father. I was particularly intrigued by this statement from the story on <a href="http://www.npr.org/2015/06/16/414896816/what-etgar-keret-learned-from-his-father-about-storytelling-and-survival?utm_source=facebook.com&amp;utm_medium=social&amp;utm_campaign=npr&amp;utm_term=nprnews&amp;utm_content=20150616">NPR</a>:
</p>

<blockquote>
<p>
I&rsquo;m pretty good at feeling sorry for myself, [but] &#x2026; the fact that he survived the Holocaust always kind of seemed to him that something good had happened to him in life. And life since the Holocaust always seemed to surprise him for the better, and there was no bitterness in him. He said, &ldquo;You know what? I&rsquo;ve been smoking two packs a day since I was 14 years old for more than 65 years and if after that you get a cancer, it&rsquo;s a fair deal,&rdquo; he says. &ldquo;It&rsquo;s fair. I&rsquo;ve got nothing to complain [about] and I&rsquo;ve lived a full life, I want to live as much as I can, but when I die when I die, I won&rsquo;t go out kicking and screaming.&rdquo;
</p>
</blockquote>

<p>
Could it be that the force of the problem of evil is a matter of one&rsquo;s attitude? What is the difference between people who focus on their suffering and those who focus on their overcoming that suffering?
</p>


<div class="tagline" id="orgaa11dbf">
<p>
Tagged: <a href="../tags/philosophy.html">Philosophy</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
